Repository: NubosNL/recruit-connect-wp
Catalog: languages/recruit-connect-wp-*.po
Languages: nl_nl

source: https://www.nubos.nl/en/recruit-connect
nl_nl: https://www.nubos.nl/nl/recruit-connect

source: Import and display job vacancies from Recruit Connect XML feed
nl_nl: Importeer en toon vacatures vanuit Recruit Connect XML feed

source: https://www.nubos.nl/en
nl_nl: https://www.nubos.nl/nl

source: Settings
nl_nl: Instellingen

source: Support
nl_nl: Ondersteuning

source: About
nl_nl: Over

source: Thank you for your application!
nl_nl: Bedankt voor je sollicitatie!

source: About Recruit Connect
nl_nl: Over Recruit Connect

source: Welcome to Recruit Connect
nl_nl: Welkom bij Recruit Connect

source: About Nubos B.V.
nl_nl: Over Nubos B.V.

source: Nubos B.V. is a leading provider of recruitment software solutions, helping businesses streamline their recruitment processes and improve hiring efficiency.
nl_nl: Nubos B.V. is een toonaangevende leverancier van recruitment software oplossingen, die bedrijven helpt hun recruitment processen te stroomlijnen en de efficiÃ«ntie van de werving te verbeteren.

source: Recruit Connect Features
nl_nl: Recruit Connect Functies

source: Automated XML vacancy import
nl_nl: Geautomatiseerde XML vacature import

source: Customizable application forms
nl_nl: Aanpasbare sollicitatieformulieren

source: Advanced search functionality
nl_nl: Geavanceerde zoekfunctionaliteit

source: Detailed vacancy pages
nl_nl: Gedetailleerde vacaturepagina's

source: Integration with your existing website
nl_nl: Integratie met je bestaande website

source: Useful Links
nl_nl: Handige Links

source: Visit Product Website
nl_nl: Bezoek Productwebsite

source: Contact Us
nl_nl: Neem Contact Op

source: Plugin Information
nl_nl: Plugin Informatie

source: Version
nl_nl: Versie

source: WordPress Version
nl_nl: WordPress Versie

source: PHP Version
nl_nl: PHP Versie

source: Statistics
nl_nl: Statistieken

source: Total Vacancies
nl_nl: Totaal Aantal Vacatures

source: Total Applications
nl_nl: Totaal Aantal Sollicitaties

source: Last Import
nl_nl: Laatste Import

source: Never
nl_nl: Nooit

source: Recruit Connect Settings
nl_nl: Recruit Connect Instellingen

source: General
nl_nl: Algemeen

source: Application Form
nl_nl: Sollicitatieformulier

source: Synchronization
nl_nl: Synchronisatie

source: Logs
nl_nl: Logboeken

source: Thank You Message
nl_nl: Bedankbericht

source: Message shown after successful application submission
nl_nl: Bericht dat wordt getoond na succesvolle sollicitatie

source: Required Fields
nl_nl: Verplichte Velden

source: Full Name
nl_nl: Volledige Naam

source: Email Address
nl_nl: E-mailadres

source: Phone Number
nl_nl: Telefoonnummer

source: CV Upload
nl_nl: CV Uploaden

source: Motivation Letter
nl_nl: Motivatiebrief

source: Select which fields should be required in the application form
nl_nl: Selecteer welke velden verplicht moeten zijn in het sollicitatieformulier

source: Enter the URL of your Recruit Connect XML feed
nl_nl: Voer de URL van je Recruit Connect XML feed in

source: Application Destination URL
nl_nl: URL Sollicitatiebestemming

source: URL where application forms will be submitted
nl_nl: URL waar sollicitatieformulieren worden ingediend

source: Vacancy Detail URL Parameter
nl_nl: URL Parameter Vacature Detail

source: URL parameter used for vacancy detail pages
nl_nl: URL parameter gebruikt voor vacature detailpagina's

source: Search Components
nl_nl: Zoekcomponenten

source: Category
nl_nl: Categorie

source: Education
nl_nl: Opleiding

source: Job Type
nl_nl: Soort Dienstverband

source: Time
nl_nl: Tijd

source: Message
nl_nl: Bericht

source: Clear Logs
nl_nl: Logboeken Wissen

source: No logs available.
nl_nl: Geen logboeken beschikbaar.

source: Are you sure you want to clear all logs?
nl_nl: Weet je zeker dat je alle logboeken wilt wissen?

source: XML Check Frequency
nl_nl: XML Controle Frequentie

source: Hourly
nl_nl: Elk uur

source: Twice Daily
nl_nl: Twee keer per dag

source: Daily
nl_nl: Dagelijks

source: Every 4 Hours
nl_nl: Elke 4 uur

source: Manual Sync
nl_nl: Handmatige Synchronisatie

source: Sync Now
nl_nl: Nu Synchroniseren

source: Recent Logs
nl_nl: Recente Logboeken

source: Connection error occurred
nl_nl: Verbindingsfout opgetreden

source: Recruit Connect Support
nl_nl: Recruit Connect Ondersteuning

source: Your Name
nl_nl: Jouw Naam

source: Your Email
nl_nl: Jouw E-mail

source: Subject
nl_nl: Onderwerp

source: Send Support Request
nl_nl: Verzend Ondersteuningsverzoek

source: Connection error occurred. Please try again.
nl_nl: Verbindingsfout opgetreden. Probeer het opnieuw.

source: This plugin requires WordPress version 6.0 or higher.
nl_nl: Deze plugin vereist WordPress versie 6.0 of hoger.

source: Plugin Activation Error
nl_nl: Plugin Activeringsfout

source: The <strong>Recruit Connect WP</strong> plugin requires the <strong>Advanced Custom Fields</strong> plugin to be installed and activated. <a href="%s" target="_blank">Install Now</a>
nl_nl: De <strong>Recruit Connect WP</strong> plugin vereist dat de <strong>Advanced Custom Fields</strong> plugin geÃ¯nstalleerd en geactiveerd is. <a href="%s" target="_blank">Installeer nu</a>

source: Unauthorized access
nl_nl: Onbevoegde toegang

source: All fields are required
nl_nl: Alle velden zijn verplicht

source: New Support Request from Recruit Connect WP Plugin
nl_nl: Nieuw Ondersteuningsverzoek van Recruit Connect WP Plugin

source: Name
nl_nl: Naam

source: Site Information
nl_nl: Site Informatie

source: Support request sent successfully
nl_nl: Ondersteuningsverzoek succesvol verzonden

source: Failed to send support request. Please try again or contact us directly.
nl_nl: Verzenden van ondersteuningsverzoek mislukt. Probeer het opnieuw of neem direct contact met ons op.

source: Field %s is required
nl_nl: Veld %s is verplicht

source: Application from %s for %s
nl_nl: Sollicitatie van %s voor %s

source: Failed to store application
nl_nl: Opslaan van sollicitatie mislukt

source: Vacancy Fields
nl_nl: Vacature Velden

source: Vacancy ID
nl_nl: Vacature ID

source: Company
nl_nl: Bedrijf

source: City
nl_nl: Plaats

source: Created At
nl_nl: Aangemaakt op

source: Street Address
nl_nl: Straatnaam

source: Postal Code
nl_nl: Postcode

source: State
nl_nl: Provincie

source: Country
nl_nl: Land

source: Salary
nl_nl: Salaris

source: Experience
nl_nl: Ervaring

source: Remote Type
nl_nl: Soort Remote

source: Recruiter Name
nl_nl: Naam Recruiter

source: Recruiter Email
nl_nl: E-mail Recruiter

source: Recruiter Image
nl_nl: Afbeelding Recruiter

source: Application Fields
nl_nl: Sollicitatievelden

source: Applicant Name
nl_nl: Naam Sollicitant

source: Applicant Email
nl_nl: E-mail Sollicitant

source: Applicant Phone
nl_nl: Telefoon Sollicitant

source: Applicant Motivation
nl_nl: Motivatie Sollicitant

source: Applicant CV
nl_nl: CV Sollicitant

source: Application Type
nl_nl: Type Sollicitatie

source: External Submission Status
nl_nl: Externe Indiendstatus

source: Last Error
nl_nl: Laatste Fout

source: New Application: %s
nl_nl: Nieuwe Sollicitatie: %s

source: This field is required
nl_nl: Dit veld is verplicht

source: Please enter a valid email address
nl_nl: Voer een geldig e-mailadres in

source: Please enter a valid phone number
nl_nl: Voer een geldig telefoonnummer in

source: File size must be less than 10MB
nl_nl: Bestandsgrootte moet minder dan 10MB zijn

source: Only PDF, DOC, and DOCX files are allowed
nl_nl: Alleen PDF, DOC en DOCX bestanden zijn toegestaan

source: CV is required
nl_nl: CV is verplicht

source: Open Application from %s
nl_nl: Open Sollicitatie van %s

source: Application for %s from %s
nl_nl: Sollicitatie voor %s van %s

source: [Alert] Failed to submit application #%d to external endpoint
nl_nl: [Alert] Indienen van sollicitatie #%d naar extern eindpunt mislukt

source: Application #%d failed to submit to the external endpoint after multiple attempts. Last error: %s
nl_nl: Indienen van sollicitatie #%d naar het externe eindpunt is na meerdere pogingen mislukt. Laatste fout: %s

source: Salary Minimum
nl_nl: Salaris Minimum

source: Salary Maximum
nl_nl: Salaris Maximum

source: Vacancies
nl_nl: Vacatures

source: Vacancy
nl_nl: Vacature

source: Add New
nl_nl: Nieuwe Toevoegen

source: Add New Vacancy
nl_nl: Nieuwe Vacature Toevoegen

source: Edit Vacancy
nl_nl: Vacature Bewerken

source: New Vacancy
nl_nl: Nieuwe Vacature

source: View Vacancy
nl_nl: Bekijk Vacature

source: Search Vacancies
nl_nl: Zoek Vacatures

source: No vacancies found
nl_nl: Geen vacatures gevonden

source: No vacancies found in trash
nl_nl: Geen vacatures gevonden in de prullenbak

source: Applications
nl_nl: Sollicitaties

source: Application
nl_nl: Sollicitatie

source: Add New Application
nl_nl: Nieuwe Sollicitatie Toevoegen

source: Edit Application
nl_nl: Sollicitatie Bewerken

source: New Application
nl_nl: Nieuwe Sollicitatie

source: View Application
nl_nl: Bekijk Sollicitatie

source: Search Applications
nl_nl: Zoek Sollicitaties

source: No applications found
nl_nl: Geen sollicitaties gevonden

source: No applications found in trash
nl_nl: Geen sollicitaties gevonden in de prullenbak

source: Every 4 hours
nl_nl: Elke 4 uur

source: Loading...
nl_nl: Laden...

source: Close
nl_nl: Sluiten

source: View Details
nl_nl: Bekijk Details

source: Salary Range
nl_nl: Salarisbereik

source: Education Level
nl_nl: Opleidingsniveau

source: Application for:
nl_nl: Sollicitatie voor:

source: Open Application
nl_nl: Open Sollicitatie

source: Submit your application for future opportunities.
nl_nl: Dien je sollicitatie in voor toekomstige mogelijkheden.

source: Accepted formats: PDF, DOC, DOCX (max 10MB)
nl_nl: Geaccepteerde formaten: PDF, DOC, DOCX (max 10MB)

source: Submit Application
nl_nl: Sollicitatie Indienen

source: New Job Application
nl_nl: Nieuwe Sollicitatie

source: Vacancy:
nl_nl: Vacature:

source: Applicant Details:
nl_nl: Details Sollicitant:

source: Name:
nl_nl: Naam:

source: Phone:
nl_nl: Telefoon:

source: Message:
nl_nl: Bericht:

source: This email was sent from your Recruit Connect WP Plugin
nl_nl: Deze e-mail is verzonden vanuit je Recruit Connect WP Plugin

source: All Categories
nl_nl: Alle CategorieÃ«n

source: All Levels
nl_nl: Alle Niveaus

source: All Types
nl_nl: Alle Soorten

source: Search keywords
nl_nl: Zoekwoorden

source: All Education Levels
nl_nl: Alle Opleidingsniveaus

source: All Job Types
nl_nl: Alle Soorten Dienstverband

source: Search
nl_nl: Zoeken

source: No vacancies found.
nl_nl: Geen vacatures gevonden.

source: Show Filters
nl_nl: Toon Filters

source: Search vacancies...
nl_nl: Zoek vacatures...
